const List<Map<String, String>> versesOfTheDay = [
  {
    'verse': 'فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُوا لِي وَلَا تَكْفُرُونِ',
    'source': 'Surah Al-Baqarah, 152',
  },
  {
    'verse': 'الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُم بِذِكْرِ اللَّهِ',
    'source': 'Surah Ar-Ra’d, 28',
  },
  {
    'verse': 'وَاذْكُر رَّبَّكَ كَثِيرًا وَسَبِّحْ بِالْعَشِيِّ وَالْإِبْكَارِ',
    'source': 'Surah Al-Imran, 41',
  },
  {
    'verse': 'فَسَبِّحْ بِاسْمِ رَبِّكَ الْعَظِيمِ',
    'source': 'Surah Al-Waqi’ah, 74',
  },
  {
    'verse': 'إِنَّمَا الْمُؤْمِنُونَ الَّذِينَ إِذَا ذُكِرَ اللَّهُ وَجِلَتْ قُلُوبُهُمْ',
    'source': 'Surah Al-Anfal, 2',
  },
  {
    'verse': 'وَسَبِّحْهُ بُكْرَةً وَأَصِيلًا',
    'source': 'Surah Al-Furqan, 58',
  },
  {
    'verse': 'فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ',
    'source': 'Surah An-Nasr, 3',
  },
];

const List<Map<String, String>> palestineDuas = [
  {
    'dua': 'اللهم كن لإخواننا في فلسطين ناصرًا ومعينًا، وحافظًا وظهيرًا.',
    'source': 'General',
  },
  {
    'dua': 'اللهم احفظ أهل فلسطين من كل سوء، وارفع عنهم البلاء والظلم.',
    'source': 'General',
  },
  {
    'dua': 'اللهم فرج كربهم، واشفِ جرحاهم، وارحم شهداءهم، وثبت أقدامهم.',
    'source': 'General',
  },
  {
    'dua': 'اللهم ارزقهم الأمن والأمان، والسلامة والإيمان، والنصر على من عاداهم.',
    'source': 'General',
  },
  {
    'dua': 'اللهم اجبر كسرهم، وداوِ جراحهم، وكن لهم عونًا ونصيرًا.',
    'source': 'General',
  },
  {
    'dua': 'اللهم أبدل خوفهم أمنًا، وحزنهم فرحًا، وذلهم عزًا.',
    'source': 'General',
  },
  {
    'dua': 'اللهم عليك بالظالمين، فإنهم لا يعجزونك، وانصر المستضعفين في فلسطين.',
    'source': 'General',
  },
];
